blogData = {
	"postsArray": [
		{
			"postTitle" : "Three cheers for Pyglet",
			"postText" : ["I recently ran into an interesting design exercise thanks to discord and my love of video games.", "For the un-initiated. Devil May Cry (DMC) is a game series known for action, brazen characters, and a cruel yet fair style tracking system. The game capitalizes on grading the player. The better one plays DMC overtime, be it by stacking combos, collecting items quickly or performing complicated actions, the more bonuses they are rewarded with and the high grade or rank they are granted. This led me to wonder how one would go ahead and implement such a system.",  "So I did it with Python!", "In time I started looking to take it out of the terminal. While Python has plenty of great libs to work with to make this happen. I ended up with a little used but very well-loved library called Pyglet.", "Pyglet is a simple audio/visual framework built with the express purpose of making games in Python. It specializes in providing basic functionality, with very little overhead or magic happening behind the scenes.", "The library is OS agnostic. Capable of building in Windows, OS X and Linux. Maintained with care and well documented, it offers everything one needs to get started developing. The philosophy reminds me of Flask in that way. Intentionally non-intrusive, and very powerful when called upon.", "To summarize, Pyglet has my seal of approval. If you would like to find out more about the library then head over to the official wiki - https://bitbucket.org/pyglet/pyglet/wiki/Home", "if you want to keep an eye on my StyleRank exercise, I've pushed the code to Github for the world to see at - https://github.com/Berky115/StyleRanking"]
		},
		{
				"postTitle": "Website update",
				"postText": [" Patch notes..." , " * Fixed invader glitches when rendering nav page. " , " * Removed unwanted behavior on about page. " , " * Removed outdated assets"]
	},
	{
			"postTitle": "Drawing with Krita",
			"postText": ["I’ve spent a good chunk of my life enjoying cartoons. This in turn has led to a desire to learn how to draw. Inevitable this has led to a quest for THE RIGHT software to do so! The type of journey that can take you far and wide across the internet. So to save you some time... today I’d like to talk to you about Krita!","So...What Is Krita?","In short, Krita is an open-source drawing program. Made with love for those looking to draw digitally. A focus on inking/painting as opposed to image manipulation makes it a desirable alternative to Photoshop, provided you understand the purposes of the software. In my case it’s been perfect. I want a program to help/encourage me to draw by offering a variety of professional tools...and I also like NOT breaking the bank! Krita is free to use, provided you can set it up.","Now I’m not being paid here! I realize this sounds like a bit of an advertisement. The simple truth is not many folks are aware of the software. I attribute this in part to the chaotic nature of open-source builds. Bugs popping up in places you wouldn't expect was a problem in the early days of the program. Resulting in a poor reputation for the little app that could. What’s more new artists looking to dip their feet into the pool could be very easily intimidated by the power/tools on display. As a result, more straightforward alternatives such as Gimp of Sai end up earning more love within the drawing community.","That said, if you happen to be in the market. Krita has my endorsement. I’m here to stand tall and proud with the bold souls coding away something fantastic!", "For more information. Check out the site, see the pretty pictures on display, and dare yourself to click that download button.", "https://krita.org/"]
		},

	{
			"postTitle": "Podcasting with friends",
			"postText": ["I never thought I'd work on a podcast. I did not have a long history of enjoying the format, and assumed the realm of audio equipment and editing rooms was in my past. The encouragement of friends is a powerful tool though. So here I am, approaching episode 50 of a little cast called NITWIC An in joke of an in joke that my team simply will not let go. I'm thrilled that's happened. I'll likely make a more significant summary of my experience at some point. For now, I am happy to see the cast grow, the episodes improve in quality and all the intersting jokes that have happened along the way."]
		},


		{
			"postTitle": "React.js : Shiny and Chrome",
			"postText": ["I’ve spent a few weeks looking at React.js, and have come to the conclusion that I like it…I like it a lot! So much so, I’ve used it as an excuse to rebuild this lovely website. Meaning I like it enough, to mull over tutorials for hours on end! Why do I like it you may ask? There are many reasons, and you would do well to head over to the official documentation and read about them yourself. In my case, it boils down to the following...", "JSX: JavaScript is a funny thing. A friend once told me it is the duct tape of the internet. No one wants to see it, few appreciate it’s practical uses, and it is absolutely necessary once you realize you’ve made a mistake. JSX takes this a step further, adding XML style tags that can be transformed into JavaScript. It’s a simple addition, that lets the developer generate html easily.", "Component structure: React is designed in a way that allows one to load components to a browser.  A component is a chunk of code for the view, and can be swapped or combined with other components, allowing one to easily design and prototype pieces of a webpage.", "My stance on JavaScript frameworks is one of skepticism. Many late nights on stackflow reveals evangelist for all sorts of different frameworks. Often over engineering a solution to a single problem, or riding off the hype of a fresh tutorial promising to revolutionize the way JavaScript works in 5 easy steps! “THIS IS IT!” they cry. The one library that will change webpages forever, ha-ha hooray!", "Until the year-ends, and another takes it’s place. So I’ve seen with Backbone, Angular, and now it is Reacts time to shine.", "I’m being a hip jaded developer though, and that’s a dangerous thing. Cynicism is cool during happy hour; the temperament rarely leads to anything productive. Is is the mantra of a developer to “fail and fail fast!” and so we experiment, keeping the skepticism and cynicism nicely separated. "]
		},
		{
			"postTitle": "Coding Dojo: Exercising your mind",
			"postText": ["It’s easy to think of software development as a hard science, complete with fundamental rules and logical reasoning. That’s how it’s been taught to me and truth be told there is a lot of pride in that perception. In practice though, a lot is left to personal style and the tools of the time. Design patterns of yore have been engineered away in the wake new idea’s. I believe if one isn’t careful, they can quickly get out of touch.", "Enter the coding dojo! A frequent practice where a developer sets aside a period of time to try something new. A framework, a gui, or strange challenge they’ve not been given the opportunity to mull over.", "The concept itself was introduced to me by a few senior developers looking to create a community of craftsmanship in the workplace. It’s gone through many iterations based on turn out and environmental preference, but the result has always been a positive experience. People working together, laughing and sharpening their metaphorical axes.", "I had the opportunity to lead one of these sessions recently, and I highly recommend others do the same. It’s like a jam sessions…only with less strings and more keyboards."]
		},
		{
			"postTitle": "jUnit/Mockito : Learning to tame my Tests",
			"postText": ["As I grow into a sexy young developer, I continue to learn about the battlefield that is testing. As a student, projects where often no longer then a few weeks, maybe a quarter. The benefit of testing your code so it stays nice and healthy when you leave it alone, becomes much less apparent when your projects due in 5 hours and suddenly doesn’t like to compile.", "Switching over to a code base, 10 + years old and growing into an angsty teenager. I’ve learned to appreciate a red flag going off when I accidentally gut out some functionality( note appreciate may be too strong of a word…I…understand it…getting a bunch of red thrown in my face is’nt often the greatest)", "And lo…that is where Mockito comes in. A fancy little framework that I’m becoming very interested in, if only because it teaches the fundamental idea of mocks and studs…through use…", "I can…USE the framework…and understand what I’m doing…", "and I tell ya…that’s something I’m beginning to appreciate more and more.", "now I could try and write up all about these fancy things. But  somehow, developing with them in under a year hasn’t elevated me to a master. However, if you are a young dev in the dorms or rocking the star-up coffee shop look. I highly recommend you grab your friendly search engine and check em out."]
		},
	]
}
